In [1]:
import pandas as pd

In [2]:
xlsfile=pd.ExcelFile('lec28.xlsx')

In [3]:
dframe = xlsfile.parse('Sheet1')

In [4]:
dframe

   this is a test  Unnamed: 1  Unnamed: 2
0              23         657         394
1             235           3         568
2             135          23          89
3             234          99          43
4               5          13         364